<?xml version="1.0" encoding="utf-8"?>
<xsl:stylesheet version="1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">

<xsl:import href="blocks/page.xsl"/>

<xsl:output
  omit-xml-declaration="yes" method="xml" indent="no" encoding="UTF-8"
  media-type="text/html;" doctype-system="http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"
  doctype-public="-//W3C//DTD XHTML 1.1//EN" version="1.1"/>
  
  <xsl:template match="doc" mode="body">
    <div class="l" style="opacity:.5">
      <div class="l__margin" style="float:left">
        &#160;
      </div>
      <div class="l__3column" style="float:left;background:green;">
        килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
      </div>
      <div class="l__5column" style="float:left;background:yellow;">
        килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
      </div>
    </div>
    <div class="l" style="opacity:.5">
      <div class="l__margin" style="float:left;">
        &#160;
      </div>
      <div class="l__2column" style="float:left;background:yellow;">
        килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
      </div>
      <div class="l__column" style="float:left;background:green;">
        &#160;
      </div>
      <div class="l__3column" style="float:left;background:orange;">
        килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
      </div>
    </div>
    <hr/>
    <table class="l" style="opacity:.5">
      <tbody>
        <tr>
          <td class="l__margin">&#160;</td>
          <td class="l__column">&#160;</td>
          <td class="l__column">&#160;</td>
          <td class="l__column">&#160;</td>
          <td class="l__column">&#160;</td>
          <td class="l__column">&#160;</td>
          <td class="l__column">&#160;</td>
          <td class="l__column">&#160;</td>
          <td class="l__column">&#160;</td>
          <td class="l__column">&#160;</td>
          <td class="l__column">&#160;</td>
          <td class="l__column">&#160;</td>
          <td class="l__column">&#160;</td>
          <td class="l__margin">&#160;</td>
        </tr>
        <tr>
          <td class="l__margin">
            &#160;
          </td>
          <td class="l__column" colspan="3" style="background:green;">
            килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
          </td>
          <td class="l__column" colspan="5" style="background:yellow;">
            килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
          </td>
          <td class="l__column" colspan="4">
            килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
          </td>
          <td class="l__margin">
            &#160;
          </td>
        </tr>
        <tr>
          <td class="l__margin">
            &#160;
          </td>
          <td class="l__column" colspan="2" style="background:green;">
            килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
          </td>
          <td class="l__column">
            &#160;
          </td>
          <td class="l__column" colspan="5" style="background:yellow;">
            килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
          </td>
          <td class="l__column" colspan="4">
            килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
          </td>
          <td class="l__margin">
            &#160;
          </td>
        </tr>
      </tbody>
    </table>
    <hr/>
    <div class="margin">
      <table class="layout" style="opacity:.5;margin-top:10px">
        <tbody>
          <tr>
            <td class="layout__column" colspan="3" style="background:green;">
              килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
            </td>
            <td class="layout__column" colspan="5" style="background:yellow;">
              килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
            </td>
            <td class="layout__column" colspan="4">
              килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
            </td>
          </tr>
          <tr>
            <td class="layout__column" colspan="2" style="background:green;">
              килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
            </td>
            <td class="layout__column">
              &#160;
            </td>
            <td class="layout__column" colspan="5" style="background:yellow;">
              килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
            </td>
            <td class="layout__column" colspan="4">
              килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы килограммы всякой разной хурьмы
            </td>
          </tr>
        </tbody>
      </table>
    </div>
  </xsl:template>
  
</xsl:stylesheet>

